In [1]:
import pandas as pd
import sqlite3
import numpy as np
import sqlite3
from tqdm.notebook import tqdm
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)

In [2]:
query1 = """
select *
from taxonomy
limit 5
"""

In [10]:
with sqlite3.connect('../data/hopteam.sqlite') as db: 
   taxonomy = pd.read_sql(query1, db)

In [11]:
taxonomy

,code,grouping,classification,specialization,definition,notes,display_name,section
0,193200000X,Group,Multi-Specialty,None,A business group of one or more individual pra...,[7/1/2003: new],Multi-Specialty Group,Individual
1,193400000X,Group,Single Specialty,None,A business group of one or more individual pra...,[7/1/2003: new],Single Specialty Group,Individual
2,207K00000X,Allopathic & Osteopathic Physicians,Allergy & Immunology,None,An allergist-immunologist is trained in evalua...,"Source: American Board of Medical Specialties,...",Allergy & Immunology Physician,Individual
3,207KA0200X,Allopathic & Osteopathic Physicians,Allergy & Immunology,Allergy,Definition to come...,None,Allergy Physician,Individual
4,207KI0005X,Allopathic & Osteopathic Physicians,Allergy & Immunology,Clinical & Laboratory Immunology,Definition to come...,None,Clinical & Laboratory Immunology (Allergy & Im...,Individual

In [12]:
query2 = """
select *
from profile
limit 5
"""
with sqlite3.connect('../data/hopteam.sqlite') as db: 
   profile = pd.read_sql(query2, db)
profile

,Provider_Second_Line_Business_Practice_Location_Address,Provider_Business_Practice_Location_Address_Postal_Code,Provider_Name_Suffix_Text,Provider_Name_Prefix_Text,Entity_Type_Code,Provider_Middle_Name,NPI,Provider_Business_Practice_Location_Address_State_Name,Provider_First_Line_Business_Practice_Location_Address,Provider_Last_Name_(Legal_Name),Provider_Business_Practice_Location_Address_City_Name,Provider_First_Name,Provider_Organization_Name_(Legal_Business_Name),Provider_Credential_Text,Taxonomy_Code,Taxonomy_Switch
0,None,688472944.0,None,None,1.0,A,1679576722,NE,3500 CENTRAL AVE,WIEBE,KEARNEY,DAVID,None,M.D.,207X00000X,Y
1,SUITE 300,322044736.0,None,DR.,1.0,C,1588667638,FL,1824 KING STREET,PILCHER,JACKSONVILLE,WILLIAM,None,MD,207RC0000X,Y
2,None,283044552.0,None,None,2.0,None,1497758544,NC,3418 VILLAGE DR,None,FAYETTEVILLE,None,"CUMBERLAND COUNTY HOSPITAL SYSTEM, INC",None,251G00000X,Y
3,None,770901243.0,None,DR.,1.0,None,1215930367,TX,17323 RED OAK DR,GRESSOT,HOUSTON,LAURENT,None,M.D.,207RH0003X,Y
4,None,945594515.0,None,None,2.0,None,1023011178,CA,414 S JEFFERSON ST,None,NAPA,None,COLLABRIA CARE,None,251G00000X,Y

In [18]:
query = """
select *
from referral_from
limit 5
"""
with sqlite3.connect('../data/hopteam.sqlite') as db: 
   referral_from = pd.read_sql(query, db)
referral_from

   referral_id    from_npi
0            0  1508062167
1            1  1508065640
2            2  1508052093
3            3  1508172545
4            4  1508285131

In [24]:
query = """
select *
from referral_to
limit 10
"""
with sqlite3.connect('../data/hopteam.sqlite') as db: 
   referral_to = pd.read_sql(query, db)
referral_to

   referral_id      to_npi
0            0  1730166109
1            1  1730166109
2            2  1730166109
3            3  1730166109
4            4  1730166109
5            5  1730166109
6            6  1730166109
7            7  1730166125
8            8  1730166125
9            9  1730166125

In [20]:
query = """
select *
from referrals
limit 5
"""
with sqlite3.connect('../data/hopteam.sqlite') as db: 
   referrals = pd.read_sql(query, db)
referrals

,referral_id,patient_count,transaction_count,average_day_wait,std_day_wait
0,0,350,370,53.922,72.612
1,1,25,25,49.800,55.006
2,2,16,16,109.500,70.593
3,3,14,14,103.357,75.483
4,4,20,21,89.952,89.880

In [21]:
query = """
select *
from zip_cbsa
limit 5
"""
with sqlite3.connect('../data/hopteam.sqlite') as db: 
   zip_cbsa = pd.read_sql(query, db)
zip_cbsa

     zip   cbsa        city state  res_ratio  bus_ratio  oth_ratio  tot_ratio
0  00683  41900  SAN GERMAN    PR   0.999842        1.0        1.0   0.999855
1  00683  32420  SAN GERMAN    PR   0.000158        0.0        0.0   0.000145
2  00923  41980    SAN JUAN    PR   1.000000        1.0        1.0   1.000000
3  01010  44140   BRIMFIELD    MA   0.976896        1.0        1.0   0.977816
4  01010  49340   BRIMFIELD    MA   0.023104        0.0        0.0   0.022184

In [25]:
query = """
SELECT 
    h.from_npi,
    h.to_npi,
    h.patient_count,
    h.transaction_count,
    h.average_day_wait,
    h.std_day_wait,
    n1.entity_type_code AS from_npi_entity_code,
    n2.entity_type_code AS to_npi_entity_code,
    n1.healthcare_provider_taxonomy_code AS from_npi_taxonomy_code,
    n2.healthcare_provider_taxonomy_code AS to_npi_taxonomy_code,
    t1.grouping AS from_npi_taxonomy_grouping,
    t1.classification AS from_npi_taxonomy_classification,
    t2.grouping AS to_npi_taxonomy_grouping,
    t2.classification AS to_npi_taxonomy_classification
FROM hop AS h
INNER JOIN npi AS n1
ON h.from_npi = n1.npi
INNER JOIN npi AS n2
ON h.to_npi = n2.npi
INNER JOIN taxonomy AS t1
ON t1.code = n2.healthcare_provider_taxonomy_code
INNER JOIN taxonomy AS t2
ON t2.code = n2.healthcare_provider_taxonomy_code
WHERE from_npi_entity_code = 1.0
    AND to_npi_entity_code = 2.0
"""
with sqlite3.connect('../data/hopteam.sqlite') as db: 
   TN = pd.read_sql(query, db)
TN

DatabaseError: Execution failed on sql '
SELECT
    h.from_npi,
    h.to_npi,
    h.patient_count,
    h.transaction_count,
    h.average_day_wait,
    h.std_day_wait,
    n1.entity_type_code AS from_npi_entity_code,
    n2.entity_type_code AS to_npi_entity_code,
    n1.healthcare_provider_taxonomy_code AS from_npi_taxonomy_code,
    n2.healthcare_provider_taxonomy_code AS to_npi_taxonomy_code,
    t1.grouping AS from_npi_taxonomy_grouping,
    t1.classification AS from_npi_taxonomy_classification,
    t2.grouping AS to_npi_taxonomy_grouping,
    t2.classification AS to_npi_taxonomy_classification
FROM hop AS h
INNER JOIN npi AS n1
ON h.from_npi = n1.npi
INNER JOIN npi AS n2
ON h.to_npi = n2.npi
INNER JOIN taxonomy AS t1
ON t1.code = n2.healthcare_provider_taxonomy_code
INNER JOIN taxonomy AS t2
ON t2.code = n2.healthcare_provider_taxonomy_code
WHERE from_npi_entity_code = 1.0
    AND to_npi_entity_code = 2.0
': no such table: hop